Tekla.Structures.Drawing.DwgObject
The DwgObject class defines a DWG or DXF object that can be inserted into a drawing.
The following example shows how to embed a DXF file to a drawing with
the scale 0.5:
using Tekla.Structures.Drawing;
using Tekla.Structures.Geometry3d;
using System.IO;
public class Example
{
public void Example1()
{
DrawingHandler MyDrawingHandler = new DrawingHandler();
ViewBase _view = MyDrawingHandler.GetActiveDrawing().GetSheet().GetAllViews().Current as ViewBase;
EmbeddedObjectAttributes attributes = new EmbeddedObjectAttributes();
attributes.XScale = 0.5;
attributes.YScale = 0.5;
DwgObject dxf = new DwgObject(_view, new Point(100, 100),
Path.GetFullPath("my_dxf.dxf"), attributes);
dxf.Insert();
}
}

Tekla.Structures.Drawing.DwgObject.#ctor(Tekla.Structures.Drawing.ViewBase,Tekla.Structures.Geometry3d.Point,System.String)
Creates a new DwgObject instance with the given parameters.
view: The view to be used.
insertionPoint: The insertion point to be used.
fileName: The filename to be used.
Throws System.IO.FileNotFoundException: Thrown if the specified file does not exist.

Tekla.Structures.Drawing.DwgObject.#ctor(Tekla.Structures.Drawing.ViewBase,Tekla.Structures.Geometry3d.Point,System.String,Tekla.Structures.Drawing.EmbeddedObjectAttributes)
Creates a new DwgObject instance using the specified attributes.
view: The view to be used.
insertionPoint: The insertion point to be used.
fileName: The filename to be used.
attributes: The attributes to be used.
Throws System.IO.FileNotFoundException: Thrown if the specified file does not exist.

Tekla.Structures.Drawing.DwgObject.#ctor(Tekla.Structures.Drawing.ViewBase,Tekla.Structures.Geometry3d.Point,Tekla.Structures.Drawing.Size,System.String)
Creates a new DwgObject instance with the given parameters.
view: The view to be used.
insertionPoint: The insertion point to be used.
frameSize: The frames size.
fileName: The filename to be used.
Throws System.IO.FileNotFoundException: Thrown if the specified file does not exist.

Tekla.Structures.Drawing.DwgObject.#ctor(Tekla.Structures.Drawing.ViewBase,Tekla.Structures.Geometry3d.Point,Tekla.Structures.Drawing.Size,System.String,Tekla.Structures.Drawing.EmbeddedObjectAttributes)
Creates a new DwgObject instance using the specified attributes.
view: The view to be used.
insertionPoint: The insertion point to be used.
frameSize: The frames size.
fileName: The filename to be used.
attributes: The attributes to be used.
Throws System.IO.FileNotFoundException: Thrown if the specified file does not exist.